jmeter/jmeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request - GET" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">0.0.0.0</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/companies/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJhZG1pbkBnbWFpbC5jb20iLCJhdXRoIjoiUk9MRV9BRE1JTiIsInVzZXJfbmFtZSI6ImFkbWluQGdtYWlsLmNvbSIsImlzcyI6Imp3dCIsInR5cGUiOiJhY2Nlc3MiLCJhdXRob3JpdGllcyI6WyJST0xFX0FETUlOIl0sImNsaWVudF9pZCI6ImFkbWluQGdtYWlsLmNvbSIsImF1ZCI6Imp3dCIsIm5iZiI6MTU4OTgzNDA1Miwic2NvcGUiOlsicmVhZCJdLCJuYW1lIjoiYWRtaW5AZ21haWwuY29tIiwiZXhwIjoxNTg5ODc3MjUyLCJmcmVzaCI6dHJ1ZSwiaWF0IjoxNTg5ODM0MDUyLCJqdGkiOiI0OTY5MGNhOS0wN2YyLTQwYmItODIzOS1iZTA3OTY1YWJmMDMifQ.fPaAs_X1FXjwH7ARZqGWS23i6d0I4DOOEQMu0_aQVzs3R9-HJXxh6QrhFsETOKh0H66YPv96zKCsirvBr_UL6KKoVh3P-tt3NbUn5ZQHwUj82YBU-NGtrilwXvggVzzcScLBJBPeknsDaVjEEFfNtqnUcThnevi87g8Vbh4TFym0IZIpRM4jrQJkpnlMfdFVFcex3uTpzU-QxHVRYEcnqbw_AxtaVoGSUE5PQrfb0ulXmyST-LWV75aEmKq1o9P2UthOuLKIVBi5z04UwlvABViu7mxP9rSWgWY2dZRdrepJJmxPIAcRivJP0lZa0JqJA69azwVyc4OBv15hejrOhg</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">test_result_springboot</stringProp>
        </ResultCollector>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request - POST" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;name&quot;: &quot;spring boot - test jmeter - ${__UUID()}&quot;, &#xd;
	&quot;activated&quot;: true&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">0.0.0.0</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/companies/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">bearer eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiJhZG1pbkBnbWFpbC5jb20iLCJhdXRoIjoiUk9MRV9BRE1JTiIsInVzZXJfbmFtZSI6ImFkbWluQGdtYWlsLmNvbSIsImlzcyI6Imp3dCIsInR5cGUiOiJhY2Nlc3MiLCJhdXRob3JpdGllcyI6WyJST0xFX0FETUlOIl0sImNsaWVudF9pZCI6ImFkbWluQGdtYWlsLmNvbSIsImF1ZCI6Imp3dCIsIm5iZiI6MTU4OTgzNDA1Miwic2NvcGUiOlsicmVhZCJdLCJuYW1lIjoiYWRtaW5AZ21haWwuY29tIiwiZXhwIjoxNTg5ODc3MjUyLCJmcmVzaCI6dHJ1ZSwiaWF0IjoxNTg5ODM0MDUyLCJqdGkiOiI0OTY5MGNhOS0wN2YyLTQwYmItODIzOS1iZTA3OTY1YWJmMDMifQ.fPaAs_X1FXjwH7ARZqGWS23i6d0I4DOOEQMu0_aQVzs3R9-HJXxh6QrhFsETOKh0H66YPv96zKCsirvBr_UL6KKoVh3P-tt3NbUn5ZQHwUj82YBU-NGtrilwXvggVzzcScLBJBPeknsDaVjEEFfNtqnUcThnevi87g8Vbh4TFym0IZIpRM4jrQJkpnlMfdFVFcex3uTpzU-QxHVRYEcnqbw_AxtaVoGSUE5PQrfb0ulXmyST-LWV75aEmKq1o9P2UthOuLKIVBi5z04UwlvABViu7mxP9rSWgWY2dZRdrepJJmxPIAcRivJP0lZa0JqJA69azwVyc4OBv15hejrOhg</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>